app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

INSERT INTO "animals" ("nome", "idade", "especie", "raca", "peso", "tutor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @animal = Animal.new(animal_params)
    if @animal.save