app/controllers/cargos_controller.rb

SELECT "cargos".* FROM "cargos"
---
    def index
        @cargos = Cargo.all

INSERT INTO "cargos" ("nome_cargo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome_cargo", "ADM"], ["created_at", "2024-11-12 22:59:28.652401"], ["updated_at", "2024-11-12 22:59:28.652401"]]
---
    def create
        @cargo = Cargo.new(cargo_params)
        if @cargo.save

UPDATE "cargos" SET "nome_cargo" = $1, "updated_at" = $2 WHERE "cargos"."id" = $3  [["nome_cargo", "Veterinário"], ["updated_at", "2024-11-14 17:59:51.555316"], ["id", 2]]
---
    def update
        if @cargo.update(cargo_params)

SELECT "cargos".* FROM "cargos" WHERE "cargos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_cargo
        @cargo = Cargo.find(params[:id])