app/controllers/consulta_controller.rb

  def index
    @consulta = Consulta.all
---
SELECT "consulta".* FROM "consulta"