app/controllers/consultas_controller.rb

  def index
    @consultas = Consulta.all
---
SELECT "consulta".* FROM "consulta"

  def create
    @consulta = Consulta.new(consulta_params)

    if @consulta.save
---
INSERT INTO "consultas" ("funcionario_id", "animal_id", "data", "hora", "observacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"