app/controllers/estoque_internamentos_controller.rb

SELECT "estoque_internamentos".* FROM "estoque_internamentos"
---
  def index
    @estoque_internamentos = EstoqueInternamento.all