app/controllers/estoque_vendas_controller.rb

SELECT "estoque_vendas".* FROM "estoque_vendas"
---
  def index
    @estoque_vendas = EstoqueVenda.all

INSERT INTO "estoque_vendas" ("medicamento", "preco", "quantidade_disponivel", "quantidade_venda", "fornecedor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @estoque_venda = EstoqueVenda.new(estoque_venda_params)
    if @estoque_venda.save