app/controllers/funcionarios_controller.rb

SELECT "funcionarios".* FROM "funcionarios"
---
  def index
    @funcionarios = Funcionario.all

INSERT INTO "funcionarios" ("nome", "contato", "login", "senha", "cargo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @funcionario = Funcionario.new(funcionario_params)
    if @funcionario.save

UPDATE "funcionarios" SET "nome" = $1, "updated_at" = $2 WHERE "funcionarios"."id" = $3  [["nome", "João Silva Souza"], ["updated_at", "2024-10-30 13:05:07.608552"], ["id", 1]]
---
  def update
    if @funcionario.update(funcionario_params)

DELETE FROM "funcionarios" WHERE "funcionarios"."id" = $1  [["id", 1]]
---
  def destroy
    @funcionario.destroy!

SELECT "estoque_vendas".* FROM "estoque_vendas" WHERE "estoque_vendas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def vender_produto
    id = params[:id]
    quantidade = params[:quantidade]
    estoque_venda = EstoqueVenda.find_by(id: id)

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_funcionario
    @funcionario = Funcionario.find(params[:id])