app/controllers/tutors_controller.rb

  def index
    @tutors = Tutor.all
---
SELECT "tutors".* FROM "tutors"

  def create
    @tutor = Tutor.new(tutor_params)
    if @tutor.save
---
INSERT INTO "tutors" ("nome", "endereco", "telefone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @tutor.update(tutor_params)
---
UPDATE "tutors" SET "email" = $1, "updated_at" = $2 WHERE "tutors"."id" = $3  [["email", "email@teste.com"], ["updated_at", "2024-11-12 21:39:12.306431"], ["id", 1]]

  def set_tutor
    @tutor = Tutor.find(params[:id])
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]