app/models/consulta.rb

SELECT "cargos".* FROM "cargos" WHERE "cargos"."nome_cargo" = $1 LIMIT $2  [["nome_cargo", "Veterinário"], ["LIMIT", 1]]
---
  def isVet
    cargo = Cargo.find_by(nome_cargo: "Veterinário")