app/models/estoque_venda.rb

    def retira_n_estoque quantidade_a_retirar
        if self.quantidade_disponivel < quantidade_a_retirar
            return false
        else
            self.quantidade_disponivel -= quantidade_a_retirar
            self.quantidade_venda += quantidade_a_retirar
            self.save
---
UPDATE "estoque_vendas" SET "quantidade_disponivel" = $1, "quantidade_venda" = $2, "updated_at" = $3 WHERE "estoque_vendas"."id" = $4  [["quantidade_disponivel", 507], ["quantidade_venda", 4], ["updated_at", "2024-11-12 22:06:51.607751"], ["id", 1]]